In [11]:
#data things
import numpy as np
import pandas as pd

#to evaulate
from sklearn.metrics import classification_report

#my own py files
import acquire as a
import prepare as p
import model as m

In [12]:
titanic_df=p.prep_titanic()

In [13]:
p.split_data(titanic_df, 'survived')

(     passenger_id  survived pclass     sex  sibsp  parch      fare  \
 776           776         0      3    male      0      0    7.7500
 829           829         1      1  female      0      0   80.0000
 215           215         1      1  female      1      0  113.2750
 258           258         1      1  female      0      0  512.3292
 129           129         0      3    male      0      0    6.9750
 ..            ...       ...    ...     ...    ...    ...       ...
 125           125         1      3    male      1      0   11.2417
 360           360         0      3    male      1      4   27.9000
 55             55         1      1    male      0      0   35.5000
 298           298         1      1    male      0      0   30.5000
 768           768         0      3    male      1      0   24.1500

      embark_town  alone
 776   Queenstown      1
 829  Southampton      1
 215    Cherbourg      0
 258    Cherbourg      1
 129  Southampton      1
 ..           ...    ...
 125    Cherbourg      0
 360  Southampton      0
 55   Southampton      1
 298  Southampton      1
 768   Queenstown      0

 [534 rows x 9 columns],
      passenger_id  survived pclass     sex  sibsp  parch      fare  \
 541           541         0      3  female      4      2   31.2750
 204           204         1      3    male      0      0    8.0500
 108           108         0      3    male      0      0    7.8958
 88             88         1      1  female      3      2  263.0000
 677           677         1      3  female      0      0    9.8417
 ..            ...       ...    ...     ...    ...    ...       ...
 171           171         0      3    male      4      1   29.1250
 369           369         1      1  female      0      0   69.3000
 114           114         0      3  female      0      0   14.4583
 855           855         1      3  female      0      1    9.3500
 885           885         0      3  female      0      5   29.1250

      embark_town  alone
 541  Southampton      0
 204  Southampton      1
 108  Southampton      1
 88   Southampton      0
 677  Southampton      1
 ..           ...    ...
 171   Queenstown      0
 369    Cherbourg      1
 114    Cherbourg      1
 855  Southampton      0
 885   Queenstown      0

 [178 rows x 9 columns],
      passenger_id  survived pclass     sex  sibsp  parch      fare  \
 763           763         1      1  female      1      2  120.0000
 112           112         0      3    male      0      0    8.0500
 230           230         1      1  female      1      0   83.4750
 500           500         0      3    male      0      0    8.6625
 237           237         1      2  female      0      2   26.2500
 ..            ...       ...    ...     ...    ...    ...       ...
 883           883         0      2    male      0      0   10.5000
 149           149         0      2    male      0      0   13.0000
 843           843         0      3    male      0      0    6.4375
 581           581         1      1  female      1      1  110.8833
 214           214         0      3    male      1      0    7.7500

      embark_town  alone
 763  Southampton      0
 112  Southampton      1
 230  Southampton      0
 500  Southampton      1
 237  Southampton      0
 ..           ...    ...
 883  Southampton      1
 149  Southampton      1
 843    Cherbourg      1
 581    Cherbourg      0
 214   Queenstown      0

 [179 rows x 9 columns])

In [15]:
m.preprocess_titanic(train_df, validate_df, test_df)

NameError: name 'train_df' is not defined